In [10]:
import pandas as pd
import numpy as np

In [11]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2023-01-01', periods=n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')
df

C:\Users\hp\AppData\Local\Temp\ipykernel_18264\1001407197.py:8: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  df.index = pd.date_range(start='2023-01-01', periods=n_rows, freq='H')

                index  bil_pecahan  bil_bulat teks
0 2023-01-01 00:00:00          2.0         12    A
1 2023-01-01 01:00:00         18.0          6    B
2 2023-01-01 02:00:00         17.0          9    C
3 2023-01-01 03:00:00          6.0         16    D
4 2023-01-01 04:00:00         19.0         16    E

In [12]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [13]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          2.0         12
1         18.0          6
2         17.0          9
3          6.0         16
4         19.0         16

In [14]:
df.select_dtypes(include='int')

   bil_bulat
0         12
1          6
2          9
3         16
4         16

In [15]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [16]:
df.select_dtypes(include='datetime')

                index
0 2023-01-01 00:00:00
1 2023-01-01 01:00:00
2 2023-01-01 02:00:00
3 2023-01-01 03:00:00
4 2023-01-01 04:00:00

In [18]:
df.select_dtypes(include=['int', 'object'])

   bil_bulat teks
0         12    A
1          6    B
2          9    C
3         16    D
4         16    E